#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_caller_identity.current: Reading...
data.aws_ssm_parameter.infra_output: Reading...
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=app-weather-web-task-execution-role]
data.aws_caller_identity.current: Read complete after 0s [id=743794601996]
aws_iam_role.ecs_task_role: Refreshing state... [id=app-weather-web-task-role]
data.aws_ssm_parameter.infra_output: Read complete after 0s [id=/app-weather/output]
aws_iam_policy.ecs_cloudwatch_logs_policy: Refreshing state... [id=arn:aws:iam::743794601996:policy/app-weather-web-ecs-cloudwatch-logs]
aws_iam_role_policy_attachment.custom: Refreshing state... [id=app-weather-web-task-execution-role-20241215174239643200000002]
aws_iam_role_policy_attachment.attach_cloudwatch_logs_task_execution_role: Refreshing state... [id=app-weather-web-task-execution-role-20241215174239640400000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecs_service.service will be created
  + resource "aws_ecs_service" "service" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (sensitive value)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + force_new_deployment               = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "app-weather-web"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "Source" = "https://github.com/kunduso/app-weather"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (sensitive value)
          + subnets          = (sensitive value)
        }

      + service_connect_configuration {
          + enabled   = true
          + namespace = (sensitive value)

          + log_configuration {
              + log_driver = "awslogs"
              + options    = {
                  + "awslogs-group"         = (sensitive value)
                  + "awslogs-region"        = "us-east-2"
                  + "awslogs-stream-prefix" = "service-connect"
                }
            }

          + service {
              + discovery_name = "app-weather-web"
              + port_name      = "http"

              + client_alias {
                  + dns_name = "app-weather-web"
                  + port     = 80
                }
            }
        }
    }

  # aws_ecs_task_definition.web_app will be created
  + resource "aws_ecs_task_definition" "web_app" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (sensitive value)
      + cpu                      = "1024"
      + execution_role_arn       = "arn:aws:iam::743794601996:role/app-weather-web-task-execution-role"
      + family                   = "app-weather"
      + id                       = (known after apply)
      + memory                   = "3072"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "Source" = "https://github.com/kunduso/app-weather"
        }
      + task_role_arn            = "arn:aws:iam::743794601996:role/app-weather-web-task-role"
      + track_latest             = false

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*